In [2]:
import pandas as pd

## 找出买了产品3和5的顾客
```sql
SELECT DISTINCT c1.customer FROM 
    (SELECT customer FROM customer_product WHERE product=3) as c1 
    INNER JOIN
    (SELECT customer FROM customer_product WHERE product=5) as c2
    ON c1.customer=c2.customer
```

In [3]:
# 数据
data1 = {
    'customer': sorted([x % 3 + 1 for x in range(0, 9)]),
    'product': [1, 2, 3, 3, 4, 5, 2, 4, 5],
}
customer_product = pd.DataFrame(data1)
customer_product

<div>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>customer</th>
      <th>product</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>1</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1</td>
      <td>2</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1</td>
      <td>3</td>
    </tr>
    <tr>
      <th>3</th>
      <td>2</td>
      <td>3</td>
    </tr>
    <tr>
      <th>4</th>
      <td>2</td>
      <td>4</td>
    </tr>
    <tr>
      <th>5</th>
      <td>2</td>
      <td>5</td>
    </tr>
    <tr>
      <th>6</th>
      <td>3</td>
      <td>2</td>
    </tr>
    <tr>
      <th>7</th>
      <td>3</td>
      <td>4</td>
    </tr>
    <tr>
      <th>8</th>
      <td>3</td>
      <td>5</td>
    </tr>
  </tbody>
</table>
</div>

In [4]:
# 方法
has_35 = customer_product.groupby('customer').apply(lambda x: (x['product'] == 3).any() & (x['product'] == 5).any())
rs = has_35[has_35.eq(True)]
rs

customer
2    True
dtype: bool

## 找出每个班级里成绩排名第二的学生
```sql
SELECT student,class,score FROM
 	(SELECT g2.*,
 		(SELECT count(*)+1 FROM grade WHERE class=g2.class AND score<g2.score) AS group_id 
 	FROM grade g2) AS a
 	WHERE a.group_id = 2
```

In [5]:
# 数据
data2 = {
    'class': [1, 1, 1, 2, 2, 2, 3, 3, 3],
    'student': [x+1 for x in range(0, 9)],
    'score': [85, 89, 85, 70, 93, 94, 92, 99, 70]
}
grade = pd.DataFrame(data2)
grade

<div>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>class</th>
      <th>score</th>
      <th>student</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>85</td>
      <td>1</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1</td>
      <td>89</td>
      <td>2</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1</td>
      <td>85</td>
      <td>3</td>
    </tr>
    <tr>
      <th>3</th>
      <td>2</td>
      <td>70</td>
      <td>4</td>
    </tr>
    <tr>
      <th>4</th>
      <td>2</td>
      <td>93</td>
      <td>5</td>
    </tr>
    <tr>
      <th>5</th>
      <td>2</td>
      <td>94</td>
      <td>6</td>
    </tr>
    <tr>
      <th>6</th>
      <td>3</td>
      <td>92</td>
      <td>7</td>
    </tr>
    <tr>
      <th>7</th>
      <td>3</td>
      <td>99</td>
      <td>8</td>
    </tr>
    <tr>
      <th>8</th>
      <td>3</td>
      <td>70</td>
      <td>9</td>
    </tr>
  </tbody>
</table>
</div>

In [6]:
# 方法
def get_second(df):
    return list(df.sort_values('score', ascending=False)['student'])[1]

rs = grade.groupby('class').apply(get_second)
rs

class
1    1
2    5
3    7
dtype: int64

## 给顾客的订单按时间排序
```sql
SELECT o.*,
	(SELECT count(*)+1 FROM orders WHERE customer=o.customer AND date<o.date) AS row_id 
	FROM orders AS o
	ORDER BY customer,date
```

In [7]:
# 数据
data3 = {
    'customer': [1, 1, 1, 2, 2, 2, 3, 3, 3],
    'product': [x+1 for x in range(0, 9)],
    'date': ['2014-01-02', '2014-01-04', '2014-01-07', '2014-02-01', '2014-01-14', '2014-01-22', '2014-03-01', '2014-01-03', '2014-01-01']
}
orders = pd.DataFrame(data3)
orders

<div>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>customer</th>
      <th>date</th>
      <th>product</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>2014-01-02</td>
      <td>1</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1</td>
      <td>2014-01-04</td>
      <td>2</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1</td>
      <td>2014-01-07</td>
      <td>3</td>
    </tr>
    <tr>
      <th>3</th>
      <td>2</td>
      <td>2014-02-01</td>
      <td>4</td>
    </tr>
    <tr>
      <th>4</th>
      <td>2</td>
      <td>2014-01-14</td>
      <td>5</td>
    </tr>
    <tr>
      <th>5</th>
      <td>2</td>
      <td>2014-01-22</td>
      <td>6</td>
    </tr>
    <tr>
      <th>6</th>
      <td>3</td>
      <td>2014-03-01</td>
      <td>7</td>
    </tr>
    <tr>
      <th>7</th>
      <td>3</td>
      <td>2014-01-03</td>
      <td>8</td>
    </tr>
    <tr>
      <th>8</th>
      <td>3</td>
      <td>2014-01-01</td>
      <td>9</td>
    </tr>
  </tbody>
</table>
</div>

In [8]:
# 方法
def get_rank(df):
    rk = df.rank()['date']
    df['rank'] = rk
    return df.sort_values(['customer','rank'])

rs = orders.groupby('customer').apply(get_rank)
rs

<div>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th></th>
      <th>customer</th>
      <th>date</th>
      <th>product</th>
      <th>rank</th>
    </tr>
    <tr>
      <th>customer</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th rowspan="3" valign="top">1</th>
      <th>0</th>
      <td>1</td>
      <td>2014-01-02</td>
      <td>1</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1</td>
      <td>2014-01-04</td>
      <td>2</td>
      <td>2.0</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1</td>
      <td>2014-01-07</td>
      <td>3</td>
      <td>3.0</td>
    </tr>
    <tr>
      <th rowspan="3" valign="top">2</th>
      <th>4</th>
      <td>2</td>
      <td>2014-01-14</td>
      <td>5</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>5</th>
      <td>2</td>
      <td>2014-01-22</td>
      <td>6</td>
      <td>2.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>2</td>
      <td>2014-02-01</td>
      <td>4</td>
      <td>3.0</td>
    </tr>
    <tr>
      <th rowspan="3" valign="top">3</th>
      <th>8</th>
      <td>3</td>
      <td>2014-01-01</td>
      <td>9</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>7</th>
      <td>3</td>
      <td>2014-01-03</td>
      <td>8</td>
      <td>2.0</td>
    </tr>
    <tr>
      <th>6</th>
      <td>3</td>
      <td>2014-03-01</td>
      <td>7</td>
      <td>3.0</td>
    </tr>
  </tbody>
</table>
</div>

In [9]:
from pandas import Series,DataFrame

data=[['刘玄德','男','语文',98.],['刘玄德','男','体育',60.],['关云长','男','数学',60.],['关云长','男','语文',100.]]
df=DataFrame(data,columns=['name','sex','course','score'])
df

<div>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>name</th>
      <th>sex</th>
      <th>course</th>
      <th>score</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>刘玄德</td>
      <td>男</td>
      <td>语文</td>
      <td>98.0</td>
    </tr>
    <tr>
      <th>1</th>
      <td>刘玄德</td>
      <td>男</td>
      <td>体育</td>
      <td>60.0</td>
    </tr>
    <tr>
      <th>2</th>
      <td>关云长</td>
      <td>男</td>
      <td>数学</td>
      <td>60.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>关云长</td>
      <td>男</td>
      <td>语文</td>
      <td>100.0</td>
    </tr>
  </tbody>
</table>
</div>

In [10]:
df.groupby(["name", "sex"]).apply(lambda x: x.pivot_table(columns=["course"], values='score')).unstack()

<div>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>course</th>
      <th>体育</th>
      <th>数学</th>
      <th>语文</th>
    </tr>
    <tr>
      <th>name</th>
      <th>sex</th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>关云长</th>
      <th>男</th>
      <td>NaN</td>
      <td>60.0</td>
      <td>100.0</td>
    </tr>
    <tr>
      <th>刘玄德</th>
      <th>男</th>
      <td>60.0</td>
      <td>NaN</td>
      <td>98.0</td>
    </tr>
  </tbody>
</table>
</div>

In [11]:
df.groupby("name").apply(lambda x: x.pivot_table(index=["sex"], columns=["course"], values='score'))

<div>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th></th>
      <th>体育</th>
      <th>数学</th>
      <th>语文</th>
    </tr>
    <tr>
      <th>name</th>
      <th>sex</th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>关云长</th>
      <th>男</th>
      <td>NaN</td>
      <td>60.0</td>
      <td>100.0</td>
    </tr>
    <tr>
      <th>刘玄德</th>
      <th>男</th>
      <td>60.0</td>
      <td>NaN</td>
      <td>98.0</td>
    </tr>
  </tbody>
</table>
</div>